  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/add-vms` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/03ff9a5e-59a2-40f6-a09f-100ace59d97e/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

# module.k8s-cp[0].azurerm_linux_virtual_machine.vm must be replaced
-/+ resource "azurerm_linux_virtual_machine" "vm" {
    ~ computer_name                   = "k8s-cp-0" -> (known after apply)
    - encryption_at_host_enabled      = false -> null
    ~ id                              = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-cp-0" -> (known after apply)
      name                            = "k8s-cp-0"
    ~ private_ip_address              = "10.0.0.5" -> (known after apply)
    ~ private_ip_addresses            = [
        - "10.0.0.5",
      ] -> (known after apply)
    ~ public_ip_address               = "20.72.144.223" -> (known after apply)
    ~ public_ip_addresses             = [
        - "20.72.144.223",
      ] -> (known after apply)
    - secure_boot_enabled             = false -> null
    - tags                            = {} -> null
    ~ virtual_machine_id              = "7b8e2c8b-ac6b-4a66-b516-052a30facecd" -> (known after apply)
    - vtpm_enabled                    = false -> null
      # (14 unchanged attributes hidden)

    ~ os_disk {
        ~ disk_size_gb              = 30 -> (known after apply)
        ~ name                      = "k8s-cp-0_OsDisk_1_cd6f0a52c48f4cf9919b4684d3c4ddb5" -> (known after apply)
          # (3 unchanged attributes hidden)
      }

    ~ source_image_reference {
        ~ offer     = "0001-com-ubuntu-server-focal" -> "0001-com-ubuntu-server-jammy" # forces replacement
        ~ sku       = "20_04-lts" -> "22_04-lts" # forces replacement
          # (2 unchanged attributes hidden)
      }

      # (1 unchanged block hidden)
  }

# module.k8s-node[0].azurerm_linux_virtual_machine.vm must be replaced
-/+ resource "azurerm_linux_virtual_machine" "vm" {
    ~ computer_name                   = "k8s-node-0" -> (known after apply)
    - encryption_at_host_enabled      = false -> null
    ~ id                              = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-node-0" -> (known after apply)
      name                            = "k8s-node-0"
    ~ private_ip_address              = "10.0.0.4" -> (known after apply)
    ~ private_ip_addresses            = [
        - "10.0.0.4",
      ] -> (known after apply)
    ~ public_ip_address               = "52.151.204.125" -> (known after apply)
    ~ public_ip_addresses             = [
        - "52.151.204.125",
      ] -> (known after apply)
    - secure_boot_enabled             = false -> null
    - tags                            = {} -> null
    ~ virtual_machine_id              = "12f6d6d4-aca6-44b9-a3da-2c49113833a5" -> (known after apply)
    - vtpm_enabled                    = false -> null
      # (14 unchanged attributes hidden)

    ~ os_disk {
        ~ disk_size_gb              = 30 -> (known after apply)
        ~ name                      = "k8s-node-0_OsDisk_1_946940c493034973977a558334872d63" -> (known after apply)
          # (3 unchanged attributes hidden)
      }

    ~ source_image_reference {
        ~ offer     = "0001-com-ubuntu-server-focal" -> "0001-com-ubuntu-server-jammy" # forces replacement
        ~ sku       = "20_04-lts" -> "22_04-lts" # forces replacement
          # (2 unchanged attributes hidden)
      }

      # (1 unchanged block hidden)
  }

Plan: 2 to add, 0 to change, 2 to destroy.
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-node-0]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-cp-0]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...oft.Compute/virtualMachines/k8s-node-0, 10s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...osoft.Compute/virtualMachines/k8s-cp-0, 10s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...osoft.Compute/virtualMachines/k8s-cp-0, 20s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...oft.Compute/virtualMachines/k8s-node-0, 20s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...oft.Compute/virtualMachines/k8s-node-0, 30s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...osoft.Compute/virtualMachines/k8s-cp-0, 30s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...osoft.Compute/virtualMachines/k8s-cp-0, 40s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...oft.Compute/virtualMachines/k8s-node-0, 40s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Destruction complete after 46s
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Creating...
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Destruction complete after 46s
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Creating...
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Creation complete after 46s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-cp-0]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Creation complete after 47s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-node-0]

Apply complete! Resources: 2 added, 0 changed, 2 destroyed.
```

  </details>